/* 
  Errors.strings
  SuspiciousPackage

  Created by Randy Saldinger on 3/14/14.
  Copyright (c) 2014 Mothers Ruin Software. All rights reserved.
*/

/* MRSInstallProductErrorDomain */
"NSLocalizedDescription:MRSInstallProductErrorDomain:101" = "The package “%@” is in a format not recognized by Suspicious Package.";

/* MRSInstallDistributionErrorDomain */
"NSLocalizedDescription:MRSInstallDistributionErrorDomain:101" = "The archive's Distribution file does not reference any component packages.";
"NSLocalizedDescription:MRSInstallDistributionErrorDomain:102" = "The metapackage Info.plist file does not reference any component packages.";

/* MRSArchiveResourceExtractorErrorDomain */
"NSLocalizedDescription:MRSArchiveResourceExtractorErrorDomain:101" = "The item “%2$@” can't be extracted from “%1$@”.";

/* MRSInstallArchiveErrorDomain */
"NSLocalizedDescription:MRSInstallArchiveErrorDomain:101" = "The item “%2$@” in “%1$@” is compressed and can't be streamed.";
"NSLocalizedDescription:MRSInstallArchiveErrorDomain:102" = "The item “%@” is not an OS X Installer package.";
"NSLocalizedDescription:MRSInstallArchiveErrorDomain:103" = "The item “%2$@” is missing from “%1$@”.";
"NSLocalizedDescription:MRSInstallArchiveErrorDomain:104" = "The item “%2$@” can't be extracted from “%1$@”.";

/* MRSTreeBomErrorDomain */
"NSLocalizedDescription:MRSTreeBomErrorDomain:101" = "Can't get the list of files to be installed, since the Bom entry “%@” is malformed.";
"NSLocalizedDescription:MRSTreeBomErrorDomain:102" = "Can't get the list of files to be installed, since the CPIO entry “%@” is malformed.";
"NSLocalizedDescription:MRSTreeBomErrorDomain:103" = "Can't get the list of files to be installed, since the Bom is corrupted. (%1$@)";

/* MRSTrustEvaluationErrorDomain */
"NSLocalizedDescription:MRSTrustEvaluationErrorDomain:101" = "An error occurred while evaluating the trust of the package signature.";

/* MRSExceptionErrorDomain */
"NSLocalizedDescription:MRSExceptionErrorDomain:-1001" = "An exception was thrown while examining the package: %@";

/* MRSDocumentTemplateErrorDomain */
"NSLocalizedDescription:MRSDocumentTemplateErrorDomain:101" = "Can't render template because action not specified %@";
"NSLocalizedDescription:MRSDocumentTemplateErrorDomain:102" = "Can't render template because closing token not found %@";
"NSLocalizedDescription:MRSDocumentTemplateErrorDomain:103" = "Can't render template because key path not specified %@";
"NSLocalizedDescription:MRSDocumentTemplateErrorDomain:104" = "Can't render template because no value found for %@";
"NSLocalizedDescription:MRSDocumentTemplateErrorDomain:105" = "Can't render template with unsupported data type %@";
"NSLocalizedDescription:MRSDocumentTemplateErrorDomain:106" = "Can't render template for unsupported MIME type %@";
